Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/sio.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : SIO
// Version        : 1
// Bus type       : apb
// Description    : Single-cycle IO block
//                  Provides core-local and inter-core hardware for the two
//                  processors, with single-cycle access.
// =============================================================================
#ifndef _HARDWARE_REGS_SIO_H
#define _HARDWARE_REGS_SIO_H
// =============================================================================
// Register    : SIO_CPUID
// Description : Processor core identifier
//               Value is 0 when read from processor core 0, and 1 when read
//               from processor core 1.
#define SIO_CPUID_OFFSET _u(0x00000000)
#define SIO_CPUID_BITS   _u(0xffffffff)
#define SIO_CPUID_RESET  "-"
#define SIO_CPUID_MSB    _u(31)
#define SIO_CPUID_LSB    _u(0)
#define SIO_CPUID_ACCESS "RO"
// =============================================================================
// Register    : SIO_GPIO_IN
// Description : Input value for GPIO0...31.
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               appear as zero.
#define SIO_GPIO_IN_OFFSET _u(0x00000004)
#define SIO_GPIO_IN_BITS   _u(0xffffffff)
#define SIO_GPIO_IN_RESET  _u(0x00000000)
#define SIO_GPIO_IN_MSB    _u(31)
#define SIO_GPIO_IN_LSB    _u(0)
#define SIO_GPIO_IN_ACCESS "RO"
// =============================================================================
// Register    : SIO_GPIO_HI_IN
// Description : Input value on GPIO32...47, QSPI IOs and USB pins
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               appear as zero.
#define SIO_GPIO_HI_IN_OFFSET _u(0x00000008)
#define SIO_GPIO_HI_IN_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_IN_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_QSPI_SD
// Description : Input value on QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins
#define SIO_GPIO_HI_IN_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_IN_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_IN_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_IN_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_IN_QSPI_SD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_QSPI_CSN
// Description : Input value on QSPI CSn pin
#define SIO_GPIO_HI_IN_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_IN_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_IN_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_IN_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_IN_QSPI_CSN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_QSPI_SCK
// Description : Input value on QSPI SCK pin
#define SIO_GPIO_HI_IN_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_IN_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_IN_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_IN_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_IN_QSPI_SCK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_USB_DM
// Description : Input value on USB D- pin
#define SIO_GPIO_HI_IN_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_IN_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_IN_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_IN_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_IN_USB_DM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_USB_DP
// Description : Input value on USB D+ pin
#define SIO_GPIO_HI_IN_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_IN_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_IN_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_IN_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_IN_USB_DP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_IN_GPIO
// Description : Input value on GPIO32...47
#define SIO_GPIO_HI_IN_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_IN_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_IN_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_IN_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_IN_GPIO_ACCESS "RO"
// =============================================================================
// Register    : SIO_GPIO_OUT
// Description : GPIO0...31 output value
//               Set output level (1/0 -> high/low) for GPIO0...31. Reading back
//               gives the last value written, NOT the input value from the
//               pins.
//
//               If core 0 and core 1 both write to GPIO_OUT simultaneously (or
//               to a SET/CLR/XOR alias), the result is as though the write from
//               core 0 took place first, and the write from core 1 was then
//               applied to that intermediate result.
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               ignore writes, and their output status reads back as zero. This
//               is also true for SET/CLR/XOR aliases of this register.
#define SIO_GPIO_OUT_OFFSET _u(0x00000010)
#define SIO_GPIO_OUT_BITS   _u(0xffffffff)
#define SIO_GPIO_OUT_RESET  _u(0x00000000)
#define SIO_GPIO_OUT_MSB    _u(31)
#define SIO_GPIO_OUT_LSB    _u(0)
#define SIO_GPIO_OUT_ACCESS "RW"
// =============================================================================
// Register    : SIO_GPIO_HI_OUT
// Description : Output value for GPIO32...47, QSPI IOs and USB pins.
//
//               Write to set output level (1/0 -> high/low). Reading back gives
//               the last value written, NOT the input value from the pins. If
//               core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or
//               to a SET/CLR/XOR alias), the result is as though the write from
//               core 0 took place first, and the write from core 1 was then
//               applied to that intermediate result.
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               ignore writes, and their output status reads back as zero. This
//               is also true for SET/CLR/XOR aliases of this register.
#define SIO_GPIO_HI_OUT_OFFSET _u(0x00000014)
#define SIO_GPIO_HI_OUT_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OUT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_QSPI_SD
// Description : Output value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins
#define SIO_GPIO_HI_OUT_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OUT_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OUT_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OUT_QSPI_SD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_QSPI_CSN
// Description : Output value for QSPI CSn pin
#define SIO_GPIO_HI_OUT_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OUT_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OUT_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OUT_QSPI_CSN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_QSPI_SCK
// Description : Output value for QSPI SCK pin
#define SIO_GPIO_HI_OUT_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OUT_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OUT_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OUT_QSPI_SCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_USB_DM
// Description : Output value for USB D- pin
#define SIO_GPIO_HI_OUT_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OUT_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OUT_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OUT_USB_DM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_USB_DP
// Description : Output value for USB D+ pin
#define SIO_GPIO_HI_OUT_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OUT_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OUT_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OUT_USB_DP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_GPIO
// Description : Output value for GPIO32...47
#define SIO_GPIO_HI_OUT_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OUT_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OUT_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OUT_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OUT_GPIO_ACCESS "RW"
// =============================================================================
// Register    : SIO_GPIO_OUT_SET
// Description : GPIO0...31 output value set
//               Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`
#define SIO_GPIO_OUT_SET_OFFSET _u(0x00000018)
#define SIO_GPIO_OUT_SET_BITS   _u(0xffffffff)
#define SIO_GPIO_OUT_SET_RESET  _u(0x00000000)
#define SIO_GPIO_OUT_SET_MSB    _u(31)
#define SIO_GPIO_OUT_SET_LSB    _u(0)
#define SIO_GPIO_OUT_SET_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OUT_SET
// Description : Output value set for GPIO32..47, QSPI IOs and USB pins.
//               Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |=
//               wdata`
#define SIO_GPIO_HI_OUT_SET_OFFSET _u(0x0000001c)
#define SIO_GPIO_HI_OUT_SET_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OUT_SET_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_QSPI_SD
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_QSPI_CSN
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_QSPI_SCK
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_USB_DM
#define SIO_GPIO_HI_OUT_SET_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_SET_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OUT_SET_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OUT_SET_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OUT_SET_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_USB_DP
#define SIO_GPIO_HI_OUT_SET_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_SET_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OUT_SET_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OUT_SET_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OUT_SET_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_SET_GPIO
#define SIO_GPIO_HI_OUT_SET_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OUT_SET_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OUT_SET_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OUT_SET_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OUT_SET_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_OUT_CLR
// Description : GPIO0...31 output value clear
//               Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &=
//               ~wdata`
#define SIO_GPIO_OUT_CLR_OFFSET _u(0x00000020)
#define SIO_GPIO_OUT_CLR_BITS   _u(0xffffffff)
#define SIO_GPIO_OUT_CLR_RESET  _u(0x00000000)
#define SIO_GPIO_OUT_CLR_MSB    _u(31)
#define SIO_GPIO_OUT_CLR_LSB    _u(0)
#define SIO_GPIO_OUT_CLR_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OUT_CLR
// Description : Output value clear for GPIO32..47, QSPI IOs and USB pins.
//               Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
//               &= ~wdata`
#define SIO_GPIO_HI_OUT_CLR_OFFSET _u(0x00000024)
#define SIO_GPIO_HI_OUT_CLR_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OUT_CLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_QSPI_SD
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_QSPI_CSN
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_QSPI_SCK
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_USB_DM
#define SIO_GPIO_HI_OUT_CLR_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_CLR_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OUT_CLR_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OUT_CLR_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OUT_CLR_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_USB_DP
#define SIO_GPIO_HI_OUT_CLR_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_CLR_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OUT_CLR_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OUT_CLR_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OUT_CLR_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_CLR_GPIO
#define SIO_GPIO_HI_OUT_CLR_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OUT_CLR_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OUT_CLR_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OUT_CLR_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OUT_CLR_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_OUT_XOR
// Description : GPIO0...31 output value XOR
//               Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^=
//               wdata`
#define SIO_GPIO_OUT_XOR_OFFSET _u(0x00000028)
#define SIO_GPIO_OUT_XOR_BITS   _u(0xffffffff)
#define SIO_GPIO_OUT_XOR_RESET  _u(0x00000000)
#define SIO_GPIO_OUT_XOR_MSB    _u(31)
#define SIO_GPIO_OUT_XOR_LSB    _u(0)
#define SIO_GPIO_OUT_XOR_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OUT_XOR
// Description : Output value XOR for GPIO32..47, QSPI IOs and USB pins.
//               Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
//               ^= wdata`
#define SIO_GPIO_HI_OUT_XOR_OFFSET _u(0x0000002c)
#define SIO_GPIO_HI_OUT_XOR_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OUT_XOR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_QSPI_SD
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_QSPI_CSN
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_QSPI_SCK
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_USB_DM
#define SIO_GPIO_HI_OUT_XOR_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_XOR_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OUT_XOR_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OUT_XOR_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OUT_XOR_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_USB_DP
#define SIO_GPIO_HI_OUT_XOR_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OUT_XOR_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OUT_XOR_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OUT_XOR_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OUT_XOR_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OUT_XOR_GPIO
#define SIO_GPIO_HI_OUT_XOR_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OUT_XOR_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OUT_XOR_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OUT_XOR_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OUT_XOR_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_OE
// Description : GPIO0...31 output enable
//               Set output enable (1/0 -> output/input) for GPIO0...31. Reading
//               back gives the last value written.
//
//               If core 0 and core 1 both write to GPIO_OE simultaneously (or
//               to a SET/CLR/XOR alias), the result is as though the write from
//               core 0 took place first, and the write from core 1 was then
//               applied to that intermediate result.
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               ignore writes, and their output status reads back as zero. This
//               is also true for SET/CLR/XOR aliases of this register.
#define SIO_GPIO_OE_OFFSET _u(0x00000030)
#define SIO_GPIO_OE_BITS   _u(0xffffffff)
#define SIO_GPIO_OE_RESET  _u(0x00000000)
#define SIO_GPIO_OE_MSB    _u(31)
#define SIO_GPIO_OE_LSB    _u(0)
#define SIO_GPIO_OE_ACCESS "RW"
// =============================================================================
// Register    : SIO_GPIO_HI_OE
// Description : Output enable value for GPIO32...47, QSPI IOs and USB pins.
//
//               Write output enable (1/0 -> output/input). Reading back gives
//               the last value written. If core 0 and core 1 both write to
//               GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias), the
//               result is as though the write from core 0 took place first, and
//               the write from core 1 was then applied to that intermediate
//               result.
//
//               In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
//               ignore writes, and their output status reads back as zero. This
//               is also true for SET/CLR/XOR aliases of this register.
#define SIO_GPIO_HI_OE_OFFSET _u(0x00000034)
#define SIO_GPIO_HI_OE_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_QSPI_SD
// Description : Output enable value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and
//               SD3 pins
#define SIO_GPIO_HI_OE_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OE_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OE_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OE_QSPI_SD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_QSPI_CSN
// Description : Output enable value for QSPI CSn pin
#define SIO_GPIO_HI_OE_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OE_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OE_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OE_QSPI_CSN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_QSPI_SCK
// Description : Output enable value for QSPI SCK pin
#define SIO_GPIO_HI_OE_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OE_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OE_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OE_QSPI_SCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_USB_DM
// Description : Output enable value for USB D- pin
#define SIO_GPIO_HI_OE_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OE_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OE_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OE_USB_DM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_USB_DP
// Description : Output enable value for USB D+ pin
#define SIO_GPIO_HI_OE_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OE_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OE_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OE_USB_DP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_GPIO
// Description : Output enable value for GPIO32...47
#define SIO_GPIO_HI_OE_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OE_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OE_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OE_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OE_GPIO_ACCESS "RW"
// =============================================================================
// Register    : SIO_GPIO_OE_SET
// Description : GPIO0...31 output enable set
//               Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`
#define SIO_GPIO_OE_SET_OFFSET _u(0x00000038)
#define SIO_GPIO_OE_SET_BITS   _u(0xffffffff)
#define SIO_GPIO_OE_SET_RESET  _u(0x00000000)
#define SIO_GPIO_OE_SET_MSB    _u(31)
#define SIO_GPIO_OE_SET_LSB    _u(0)
#define SIO_GPIO_OE_SET_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OE_SET
// Description : Output enable set for GPIO32...47, QSPI IOs and USB pins.
//               Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |=
//               wdata`
