Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/sio.h
#define SIO_GPIO_HI_OE_SET_OFFSET _u(0x0000003c)
#define SIO_GPIO_HI_OE_SET_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OE_SET_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_QSPI_SD
#define SIO_GPIO_HI_OE_SET_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_SET_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OE_SET_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OE_SET_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OE_SET_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_QSPI_CSN
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_QSPI_SCK
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_USB_DM
#define SIO_GPIO_HI_OE_SET_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_SET_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OE_SET_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OE_SET_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OE_SET_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_USB_DP
#define SIO_GPIO_HI_OE_SET_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_SET_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OE_SET_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OE_SET_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OE_SET_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_SET_GPIO
#define SIO_GPIO_HI_OE_SET_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OE_SET_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OE_SET_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OE_SET_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OE_SET_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_OE_CLR
// Description : GPIO0...31 output enable clear
//               Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &=
//               ~wdata`
#define SIO_GPIO_OE_CLR_OFFSET _u(0x00000040)
#define SIO_GPIO_OE_CLR_BITS   _u(0xffffffff)
#define SIO_GPIO_OE_CLR_RESET  _u(0x00000000)
#define SIO_GPIO_OE_CLR_MSB    _u(31)
#define SIO_GPIO_OE_CLR_LSB    _u(0)
#define SIO_GPIO_OE_CLR_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OE_CLR
// Description : Output enable clear for GPIO32...47, QSPI IOs and USB pins.
//               Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &=
//               ~wdata`
#define SIO_GPIO_HI_OE_CLR_OFFSET _u(0x00000044)
#define SIO_GPIO_HI_OE_CLR_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OE_CLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_QSPI_SD
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_QSPI_CSN
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_QSPI_SCK
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_USB_DM
#define SIO_GPIO_HI_OE_CLR_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_CLR_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OE_CLR_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OE_CLR_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OE_CLR_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_USB_DP
#define SIO_GPIO_HI_OE_CLR_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_CLR_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OE_CLR_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OE_CLR_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OE_CLR_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_CLR_GPIO
#define SIO_GPIO_HI_OE_CLR_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OE_CLR_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OE_CLR_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OE_CLR_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OE_CLR_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_OE_XOR
// Description : GPIO0...31 output enable XOR
//               Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^=
//               wdata`
#define SIO_GPIO_OE_XOR_OFFSET _u(0x00000048)
#define SIO_GPIO_OE_XOR_BITS   _u(0xffffffff)
#define SIO_GPIO_OE_XOR_RESET  _u(0x00000000)
#define SIO_GPIO_OE_XOR_MSB    _u(31)
#define SIO_GPIO_OE_XOR_LSB    _u(0)
#define SIO_GPIO_OE_XOR_ACCESS "WO"
// =============================================================================
// Register    : SIO_GPIO_HI_OE_XOR
// Description : Output enable XOR for GPIO32...47, QSPI IOs and USB pins.
//               Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE
//               ^= wdata`
#define SIO_GPIO_HI_OE_XOR_OFFSET _u(0x0000004c)
#define SIO_GPIO_HI_OE_XOR_BITS   _u(0xff00ffff)
#define SIO_GPIO_HI_OE_XOR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_QSPI_SD
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_BITS   _u(0xf0000000)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_MSB    _u(31)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_LSB    _u(28)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_QSPI_CSN
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_BITS   _u(0x08000000)
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_MSB    _u(27)
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_LSB    _u(27)
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_QSPI_SCK
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_BITS   _u(0x04000000)
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_MSB    _u(26)
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_LSB    _u(26)
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_USB_DM
#define SIO_GPIO_HI_OE_XOR_USB_DM_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_XOR_USB_DM_BITS   _u(0x02000000)
#define SIO_GPIO_HI_OE_XOR_USB_DM_MSB    _u(25)
#define SIO_GPIO_HI_OE_XOR_USB_DM_LSB    _u(25)
#define SIO_GPIO_HI_OE_XOR_USB_DM_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_USB_DP
#define SIO_GPIO_HI_OE_XOR_USB_DP_RESET  _u(0x0)
#define SIO_GPIO_HI_OE_XOR_USB_DP_BITS   _u(0x01000000)
#define SIO_GPIO_HI_OE_XOR_USB_DP_MSB    _u(24)
#define SIO_GPIO_HI_OE_XOR_USB_DP_LSB    _u(24)
#define SIO_GPIO_HI_OE_XOR_USB_DP_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : SIO_GPIO_HI_OE_XOR_GPIO
#define SIO_GPIO_HI_OE_XOR_GPIO_RESET  _u(0x0000)
#define SIO_GPIO_HI_OE_XOR_GPIO_BITS   _u(0x0000ffff)
#define SIO_GPIO_HI_OE_XOR_GPIO_MSB    _u(15)
#define SIO_GPIO_HI_OE_XOR_GPIO_LSB    _u(0)
#define SIO_GPIO_HI_OE_XOR_GPIO_ACCESS "WO"
// =============================================================================
// Register    : SIO_FIFO_ST
// Description : Status register for inter-core FIFOs (mailboxes).
//               There is one FIFO in the core 0 -> core 1 direction, and one
//               core 1 -> core 0. Both are 32 bits wide and 8 words deep.
//               Core 0 can see the read side of the 1->0 FIFO (RX), and the
//               write side of 0->1 FIFO (TX).
//               Core 1 can see the read side of the 0->1 FIFO (RX), and the
//               write side of 1->0 FIFO (TX).
//               The SIO IRQ for each core is the logical OR of the VLD, WOF and
//               ROE fields of its FIFO_ST register.
#define SIO_FIFO_ST_OFFSET _u(0x00000050)
#define SIO_FIFO_ST_BITS   _u(0x0000000f)
#define SIO_FIFO_ST_RESET  _u(0x00000002)
// -----------------------------------------------------------------------------
// Field       : SIO_FIFO_ST_ROE
// Description : Sticky flag indicating the RX FIFO was read when empty. This
//               read was ignored by the FIFO.
#define SIO_FIFO_ST_ROE_RESET  _u(0x0)
#define SIO_FIFO_ST_ROE_BITS   _u(0x00000008)
#define SIO_FIFO_ST_ROE_MSB    _u(3)
#define SIO_FIFO_ST_ROE_LSB    _u(3)
#define SIO_FIFO_ST_ROE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : SIO_FIFO_ST_WOF
// Description : Sticky flag indicating the TX FIFO was written when full. This
//               write was ignored by the FIFO.
#define SIO_FIFO_ST_WOF_RESET  _u(0x0)
#define SIO_FIFO_ST_WOF_BITS   _u(0x00000004)
#define SIO_FIFO_ST_WOF_MSB    _u(2)
#define SIO_FIFO_ST_WOF_LSB    _u(2)
#define SIO_FIFO_ST_WOF_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : SIO_FIFO_ST_RDY
// Description : Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR
//               is ready for more data)
#define SIO_FIFO_ST_RDY_RESET  _u(0x1)
#define SIO_FIFO_ST_RDY_BITS   _u(0x00000002)
#define SIO_FIFO_ST_RDY_MSB    _u(1)
#define SIO_FIFO_ST_RDY_LSB    _u(1)
#define SIO_FIFO_ST_RDY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_FIFO_ST_VLD
// Description : Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD
//               is valid)
#define SIO_FIFO_ST_VLD_RESET  _u(0x0)
#define SIO_FIFO_ST_VLD_BITS   _u(0x00000001)
#define SIO_FIFO_ST_VLD_MSB    _u(0)
#define SIO_FIFO_ST_VLD_LSB    _u(0)
#define SIO_FIFO_ST_VLD_ACCESS "RO"
// =============================================================================
// Register    : SIO_FIFO_WR
// Description : Write access to this core's TX FIFO
#define SIO_FIFO_WR_OFFSET _u(0x00000054)
#define SIO_FIFO_WR_BITS   _u(0xffffffff)
#define SIO_FIFO_WR_RESET  _u(0x00000000)
#define SIO_FIFO_WR_MSB    _u(31)
#define SIO_FIFO_WR_LSB    _u(0)
#define SIO_FIFO_WR_ACCESS "WF"
// =============================================================================
// Register    : SIO_FIFO_RD
// Description : Read access to this core's RX FIFO
#define SIO_FIFO_RD_OFFSET _u(0x00000058)
#define SIO_FIFO_RD_BITS   _u(0xffffffff)
#define SIO_FIFO_RD_RESET  "-"
#define SIO_FIFO_RD_MSB    _u(31)
#define SIO_FIFO_RD_LSB    _u(0)
#define SIO_FIFO_RD_ACCESS "RF"
// =============================================================================
// Register    : SIO_SPINLOCK_ST
// Description : Spinlock state
//               A bitmap containing the state of all 32 spinlocks (1=locked).
//               Mainly intended for debugging.
#define SIO_SPINLOCK_ST_OFFSET _u(0x0000005c)
#define SIO_SPINLOCK_ST_BITS   _u(0xffffffff)
#define SIO_SPINLOCK_ST_RESET  _u(0x00000000)
#define SIO_SPINLOCK_ST_MSB    _u(31)
#define SIO_SPINLOCK_ST_LSB    _u(0)
#define SIO_SPINLOCK_ST_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_ACCUM0
// Description : Read/write access to accumulator 0
#define SIO_INTERP0_ACCUM0_OFFSET _u(0x00000080)
#define SIO_INTERP0_ACCUM0_BITS   _u(0xffffffff)
#define SIO_INTERP0_ACCUM0_RESET  _u(0x00000000)
#define SIO_INTERP0_ACCUM0_MSB    _u(31)
#define SIO_INTERP0_ACCUM0_LSB    _u(0)
#define SIO_INTERP0_ACCUM0_ACCESS "RW"
// =============================================================================
// Register    : SIO_INTERP0_ACCUM1
// Description : Read/write access to accumulator 1
#define SIO_INTERP0_ACCUM1_OFFSET _u(0x00000084)
#define SIO_INTERP0_ACCUM1_BITS   _u(0xffffffff)
#define SIO_INTERP0_ACCUM1_RESET  _u(0x00000000)
#define SIO_INTERP0_ACCUM1_MSB    _u(31)
#define SIO_INTERP0_ACCUM1_LSB    _u(0)
#define SIO_INTERP0_ACCUM1_ACCESS "RW"
// =============================================================================
// Register    : SIO_INTERP0_BASE0
// Description : Read/write access to BASE0 register.
#define SIO_INTERP0_BASE0_OFFSET _u(0x00000088)
#define SIO_INTERP0_BASE0_BITS   _u(0xffffffff)
#define SIO_INTERP0_BASE0_RESET  _u(0x00000000)
#define SIO_INTERP0_BASE0_MSB    _u(31)
#define SIO_INTERP0_BASE0_LSB    _u(0)
#define SIO_INTERP0_BASE0_ACCESS "RW"
// =============================================================================
// Register    : SIO_INTERP0_BASE1
// Description : Read/write access to BASE1 register.
#define SIO_INTERP0_BASE1_OFFSET _u(0x0000008c)
#define SIO_INTERP0_BASE1_BITS   _u(0xffffffff)
#define SIO_INTERP0_BASE1_RESET  _u(0x00000000)
#define SIO_INTERP0_BASE1_MSB    _u(31)
#define SIO_INTERP0_BASE1_LSB    _u(0)
#define SIO_INTERP0_BASE1_ACCESS "RW"
// =============================================================================
// Register    : SIO_INTERP0_BASE2
// Description : Read/write access to BASE2 register.
#define SIO_INTERP0_BASE2_OFFSET _u(0x00000090)
#define SIO_INTERP0_BASE2_BITS   _u(0xffffffff)
#define SIO_INTERP0_BASE2_RESET  _u(0x00000000)
#define SIO_INTERP0_BASE2_MSB    _u(31)
#define SIO_INTERP0_BASE2_LSB    _u(0)
#define SIO_INTERP0_BASE2_ACCESS "RW"
// =============================================================================
// Register    : SIO_INTERP0_POP_LANE0
// Description : Read LANE0 result, and simultaneously write lane results to
//               both accumulators (POP).
#define SIO_INTERP0_POP_LANE0_OFFSET _u(0x00000094)
#define SIO_INTERP0_POP_LANE0_BITS   _u(0xffffffff)
#define SIO_INTERP0_POP_LANE0_RESET  _u(0x00000000)
#define SIO_INTERP0_POP_LANE0_MSB    _u(31)
#define SIO_INTERP0_POP_LANE0_LSB    _u(0)
#define SIO_INTERP0_POP_LANE0_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_POP_LANE1
// Description : Read LANE1 result, and simultaneously write lane results to
//               both accumulators (POP).
#define SIO_INTERP0_POP_LANE1_OFFSET _u(0x00000098)
#define SIO_INTERP0_POP_LANE1_BITS   _u(0xffffffff)
#define SIO_INTERP0_POP_LANE1_RESET  _u(0x00000000)
#define SIO_INTERP0_POP_LANE1_MSB    _u(31)
#define SIO_INTERP0_POP_LANE1_LSB    _u(0)
#define SIO_INTERP0_POP_LANE1_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_POP_FULL
// Description : Read FULL result, and simultaneously write lane results to both
//               accumulators (POP).
#define SIO_INTERP0_POP_FULL_OFFSET _u(0x0000009c)
#define SIO_INTERP0_POP_FULL_BITS   _u(0xffffffff)
#define SIO_INTERP0_POP_FULL_RESET  _u(0x00000000)
#define SIO_INTERP0_POP_FULL_MSB    _u(31)
#define SIO_INTERP0_POP_FULL_LSB    _u(0)
#define SIO_INTERP0_POP_FULL_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_PEEK_LANE0
// Description : Read LANE0 result, without altering any internal state (PEEK).
#define SIO_INTERP0_PEEK_LANE0_OFFSET _u(0x000000a0)
#define SIO_INTERP0_PEEK_LANE0_BITS   _u(0xffffffff)
#define SIO_INTERP0_PEEK_LANE0_RESET  _u(0x00000000)
#define SIO_INTERP0_PEEK_LANE0_MSB    _u(31)
#define SIO_INTERP0_PEEK_LANE0_LSB    _u(0)
#define SIO_INTERP0_PEEK_LANE0_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_PEEK_LANE1
// Description : Read LANE1 result, without altering any internal state (PEEK).
#define SIO_INTERP0_PEEK_LANE1_OFFSET _u(0x000000a4)
#define SIO_INTERP0_PEEK_LANE1_BITS   _u(0xffffffff)
#define SIO_INTERP0_PEEK_LANE1_RESET  _u(0x00000000)
#define SIO_INTERP0_PEEK_LANE1_MSB    _u(31)
#define SIO_INTERP0_PEEK_LANE1_LSB    _u(0)
#define SIO_INTERP0_PEEK_LANE1_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_PEEK_FULL
// Description : Read FULL result, without altering any internal state (PEEK).
#define SIO_INTERP0_PEEK_FULL_OFFSET _u(0x000000a8)
#define SIO_INTERP0_PEEK_FULL_BITS   _u(0xffffffff)
#define SIO_INTERP0_PEEK_FULL_RESET  _u(0x00000000)
#define SIO_INTERP0_PEEK_FULL_MSB    _u(31)
#define SIO_INTERP0_PEEK_FULL_LSB    _u(0)
#define SIO_INTERP0_PEEK_FULL_ACCESS "RO"
// =============================================================================
// Register    : SIO_INTERP0_CTRL_LANE0
// Description : Control register for lane 0
#define SIO_INTERP0_CTRL_LANE0_OFFSET _u(0x000000ac)
#define SIO_INTERP0_CTRL_LANE0_BITS   _u(0x03bfffff)
#define SIO_INTERP0_CTRL_LANE0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_OVERF
// Description : Set if either OVERF0 or OVERF1 is set.
#define SIO_INTERP0_CTRL_LANE0_OVERF_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_OVERF_BITS   _u(0x02000000)
#define SIO_INTERP0_CTRL_LANE0_OVERF_MSB    _u(25)
#define SIO_INTERP0_CTRL_LANE0_OVERF_LSB    _u(25)
#define SIO_INTERP0_CTRL_LANE0_OVERF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_OVERF1
// Description : Indicates if any masked-off MSBs in ACCUM1 are set.
#define SIO_INTERP0_CTRL_LANE0_OVERF1_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_OVERF1_BITS   _u(0x01000000)
#define SIO_INTERP0_CTRL_LANE0_OVERF1_MSB    _u(24)
#define SIO_INTERP0_CTRL_LANE0_OVERF1_LSB    _u(24)
#define SIO_INTERP0_CTRL_LANE0_OVERF1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_OVERF0
// Description : Indicates if any masked-off MSBs in ACCUM0 are set.
#define SIO_INTERP0_CTRL_LANE0_OVERF0_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_OVERF0_BITS   _u(0x00800000)
#define SIO_INTERP0_CTRL_LANE0_OVERF0_MSB    _u(23)
#define SIO_INTERP0_CTRL_LANE0_OVERF0_LSB    _u(23)
#define SIO_INTERP0_CTRL_LANE0_OVERF0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_BLEND
// Description : Only present on INTERP0 on each core. If BLEND mode is enabled:
//               - LANE1 result is a linear interpolation between BASE0 and
//               BASE1, controlled
//               by the 8 LSBs of lane 1 shift and mask value (a fractional
//               number between
//               0 and 255/256ths)
//               - LANE0 result does not have BASE0 added (yields only the 8
//               LSBs of lane 1 shift+mask value)
//               - FULL result does not have lane 1 shift+mask value added
//               (BASE2 + lane 0 shift+mask)
//               LANE1 SIGNED flag controls whether the interpolation is signed
//               or unsigned.
#define SIO_INTERP0_CTRL_LANE0_BLEND_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_BLEND_BITS   _u(0x00200000)
#define SIO_INTERP0_CTRL_LANE0_BLEND_MSB    _u(21)
#define SIO_INTERP0_CTRL_LANE0_BLEND_LSB    _u(21)
#define SIO_INTERP0_CTRL_LANE0_BLEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_FORCE_MSB
// Description : ORed into bits 29:28 of the lane result presented to the
//               processor on the bus.
//               No effect on the internal 32-bit datapath. Handy for using a
//               lane to generate sequence
//               of pointers into flash or SRAM.
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_BITS   _u(0x00180000)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_MSB    _u(20)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_LSB    _u(19)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_ADD_RAW
// Description : If 1, mask + shift is bypassed for LANE0 result. This does not
//               affect FULL result.
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_BITS   _u(0x00040000)
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_MSB    _u(18)
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_LSB    _u(18)
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_CROSS_RESULT
// Description : If 1, feed the opposite lane's result into this lane's
//               accumulator on POP.
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_BITS   _u(0x00020000)
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_MSB    _u(17)
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_LSB    _u(17)
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_CROSS_INPUT
// Description : If 1, feed the opposite lane's accumulator into this lane's
//               shift + mask hardware.
//               Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is
//               before the shift+mask bypass)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_BITS   _u(0x00010000)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_MSB    _u(16)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_LSB    _u(16)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_SIGNED
// Description : If SIGNED is set, the shifted and masked accumulator value is
//               sign-extended to 32 bits
//               before adding to BASE0, and LANE0 PEEK/POP appear extended to
//               32 bits when read by processor.
#define SIO_INTERP0_CTRL_LANE0_SIGNED_RESET  _u(0x0)
#define SIO_INTERP0_CTRL_LANE0_SIGNED_BITS   _u(0x00008000)
#define SIO_INTERP0_CTRL_LANE0_SIGNED_MSB    _u(15)
#define SIO_INTERP0_CTRL_LANE0_SIGNED_LSB    _u(15)
#define SIO_INTERP0_CTRL_LANE0_SIGNED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_INTERP0_CTRL_LANE0_MASK_MSB
// Description : The most-significant bit allowed to pass by the mask
//               (inclusive)
//               Setting MSB < LSB may cause chip to turn inside-out
