Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/sio.h
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK26_OFFSET _u(0x00000168)
#define SIO_SPINLOCK26_BITS   _u(0xffffffff)
#define SIO_SPINLOCK26_RESET  _u(0x00000000)
#define SIO_SPINLOCK26_MSB    _u(31)
#define SIO_SPINLOCK26_LSB    _u(0)
#define SIO_SPINLOCK26_ACCESS "RW"
// =============================================================================
// Register    : SIO_SPINLOCK27
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK27_OFFSET _u(0x0000016c)
#define SIO_SPINLOCK27_BITS   _u(0xffffffff)
#define SIO_SPINLOCK27_RESET  _u(0x00000000)
#define SIO_SPINLOCK27_MSB    _u(31)
#define SIO_SPINLOCK27_LSB    _u(0)
#define SIO_SPINLOCK27_ACCESS "RW"
// =============================================================================
// Register    : SIO_SPINLOCK28
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK28_OFFSET _u(0x00000170)
#define SIO_SPINLOCK28_BITS   _u(0xffffffff)
#define SIO_SPINLOCK28_RESET  _u(0x00000000)
#define SIO_SPINLOCK28_MSB    _u(31)
#define SIO_SPINLOCK28_LSB    _u(0)
#define SIO_SPINLOCK28_ACCESS "RW"
// =============================================================================
// Register    : SIO_SPINLOCK29
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK29_OFFSET _u(0x00000174)
#define SIO_SPINLOCK29_BITS   _u(0xffffffff)
#define SIO_SPINLOCK29_RESET  _u(0x00000000)
#define SIO_SPINLOCK29_MSB    _u(31)
#define SIO_SPINLOCK29_LSB    _u(0)
#define SIO_SPINLOCK29_ACCESS "RW"
// =============================================================================
// Register    : SIO_SPINLOCK30
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK30_OFFSET _u(0x00000178)
#define SIO_SPINLOCK30_BITS   _u(0xffffffff)
#define SIO_SPINLOCK30_RESET  _u(0x00000000)
#define SIO_SPINLOCK30_MSB    _u(31)
#define SIO_SPINLOCK30_LSB    _u(0)
#define SIO_SPINLOCK30_ACCESS "RW"
// =============================================================================
// Register    : SIO_SPINLOCK31
// Description : Reading from a spinlock address will:
//               - Return 0 if lock is already locked
//               - Otherwise return nonzero, and simultaneously claim the lock
//
//               Writing (any value) releases the lock.
//               If core 0 and core 1 attempt to claim the same lock
//               simultaneously, core 0 wins.
//               The value returned on success is 0x1 << lock number.
#define SIO_SPINLOCK31_OFFSET _u(0x0000017c)
#define SIO_SPINLOCK31_BITS   _u(0xffffffff)
#define SIO_SPINLOCK31_RESET  _u(0x00000000)
#define SIO_SPINLOCK31_MSB    _u(31)
#define SIO_SPINLOCK31_LSB    _u(0)
#define SIO_SPINLOCK31_ACCESS "RW"
// =============================================================================
// Register    : SIO_DOORBELL_OUT_SET
// Description : Trigger a doorbell interrupt on the opposite core.
//
//               Write 1 to a bit to set the corresponding bit in DOORBELL_IN on
//               the opposite core. This raises the opposite core's doorbell
//               interrupt.
//
//               Read to get the status of the doorbells currently asserted on
//               the opposite core. This is equivalent to that core reading its
//               own DOORBELL_IN status.
#define SIO_DOORBELL_OUT_SET_OFFSET _u(0x00000180)
#define SIO_DOORBELL_OUT_SET_BITS   _u(0x000000ff)
#define SIO_DOORBELL_OUT_SET_RESET  _u(0x00000000)
#define SIO_DOORBELL_OUT_SET_MSB    _u(7)
#define SIO_DOORBELL_OUT_SET_LSB    _u(0)
#define SIO_DOORBELL_OUT_SET_ACCESS "RW"
// =============================================================================
// Register    : SIO_DOORBELL_OUT_CLR
// Description : Clear doorbells which have been posted to the opposite core.
//               This register is intended for debugging and initialisation
//               purposes.
//
//               Writing 1 to a bit in DOORBELL_OUT_CLR clears the corresponding
//               bit in DOORBELL_IN on the opposite core. Clearing all bits will
//               cause that core's doorbell interrupt to deassert. Since the
//               usual order of events is for software to send events using
//               DOORBELL_OUT_SET, and acknowledge incoming events by writing to
//               DOORBELL_IN_CLR, this register should be used with caution to
//               avoid race conditions.
//
//               Reading returns the status of the doorbells currently asserted
//               on the other core, i.e. is equivalent to that core reading its
//               own DOORBELL_IN status.
#define SIO_DOORBELL_OUT_CLR_OFFSET _u(0x00000184)
#define SIO_DOORBELL_OUT_CLR_BITS   _u(0x000000ff)
#define SIO_DOORBELL_OUT_CLR_RESET  _u(0x00000000)
#define SIO_DOORBELL_OUT_CLR_MSB    _u(7)
#define SIO_DOORBELL_OUT_CLR_LSB    _u(0)
#define SIO_DOORBELL_OUT_CLR_ACCESS "WC"
// =============================================================================
// Register    : SIO_DOORBELL_IN_SET
// Description : Write 1s to trigger doorbell interrupts on this core. Read to
//               get status of doorbells currently asserted on this core.
#define SIO_DOORBELL_IN_SET_OFFSET _u(0x00000188)
#define SIO_DOORBELL_IN_SET_BITS   _u(0x000000ff)
#define SIO_DOORBELL_IN_SET_RESET  _u(0x00000000)
#define SIO_DOORBELL_IN_SET_MSB    _u(7)
#define SIO_DOORBELL_IN_SET_LSB    _u(0)
#define SIO_DOORBELL_IN_SET_ACCESS "RW"
// =============================================================================
// Register    : SIO_DOORBELL_IN_CLR
// Description : Check and acknowledge doorbells posted to this core. This
//               core's doorbell interrupt is asserted when any bit in this
//               register is 1.
//
//               Write 1 to each bit to clear that bit. The doorbell interrupt
//               deasserts once all bits are cleared. Read to get status of
//               doorbells currently asserted on this core.
#define SIO_DOORBELL_IN_CLR_OFFSET _u(0x0000018c)
#define SIO_DOORBELL_IN_CLR_BITS   _u(0x000000ff)
#define SIO_DOORBELL_IN_CLR_RESET  _u(0x00000000)
#define SIO_DOORBELL_IN_CLR_MSB    _u(7)
#define SIO_DOORBELL_IN_CLR_LSB    _u(0)
#define SIO_DOORBELL_IN_CLR_ACCESS "WC"
// =============================================================================
// Register    : SIO_PERI_NONSEC
// Description : Detach certain core-local peripherals from Secure SIO, and
//               attach them to Non-secure SIO, so that Non-secure software can
//               use them. Attempting to access one of these peripherals from
//               the Secure SIO when it is attached to the Non-secure SIO, or
//               vice versa, will generate a bus error.
//
//               This register is per-core, and is only present on the Secure
//               SIO.
//
//               Most SIO hardware is duplicated across the Secure and Non-
//               secure SIO, so is not listed in this register.
#define SIO_PERI_NONSEC_OFFSET _u(0x00000190)
#define SIO_PERI_NONSEC_BITS   _u(0x00000023)
#define SIO_PERI_NONSEC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_PERI_NONSEC_TMDS
// Description : IF 1, detach TMDS encoder (of this core) from the Secure SIO,
//               and attach to the Non-secure SIO.
#define SIO_PERI_NONSEC_TMDS_RESET  _u(0x0)
#define SIO_PERI_NONSEC_TMDS_BITS   _u(0x00000020)
#define SIO_PERI_NONSEC_TMDS_MSB    _u(5)
#define SIO_PERI_NONSEC_TMDS_LSB    _u(5)
#define SIO_PERI_NONSEC_TMDS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_PERI_NONSEC_INTERP1
// Description : If 1, detach interpolator 1 (of this core) from the Secure SIO,
//               and attach to the Non-secure SIO.
#define SIO_PERI_NONSEC_INTERP1_RESET  _u(0x0)
#define SIO_PERI_NONSEC_INTERP1_BITS   _u(0x00000002)
#define SIO_PERI_NONSEC_INTERP1_MSB    _u(1)
#define SIO_PERI_NONSEC_INTERP1_LSB    _u(1)
#define SIO_PERI_NONSEC_INTERP1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_PERI_NONSEC_INTERP0
// Description : If 1, detach interpolator 0 (of this core) from the Secure SIO,
//               and attach to the Non-secure SIO.
#define SIO_PERI_NONSEC_INTERP0_RESET  _u(0x0)
#define SIO_PERI_NONSEC_INTERP0_BITS   _u(0x00000001)
#define SIO_PERI_NONSEC_INTERP0_MSB    _u(0)
#define SIO_PERI_NONSEC_INTERP0_LSB    _u(0)
#define SIO_PERI_NONSEC_INTERP0_ACCESS "RW"
// =============================================================================
// Register    : SIO_RISCV_SOFTIRQ
// Description : Control the assertion of the standard software interrupt
//               (MIP.MSIP) on the RISC-V cores.
//
//               Unlike the RISC-V timer, this interrupt is not routed to a
//               normal system-level interrupt line, so can not be used by the
//               Arm cores.
//
//               It is safe for both cores to write to this register on the same
//               cycle. The set/clear effect is accumulated across both cores,
//               and then applied. If a flag is both set and cleared on the same
//               cycle, only the set takes effect.
#define SIO_RISCV_SOFTIRQ_OFFSET _u(0x000001a0)
#define SIO_RISCV_SOFTIRQ_BITS   _u(0x00000303)
#define SIO_RISCV_SOFTIRQ_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_RISCV_SOFTIRQ_CORE1_CLR
// Description : Write 1 to atomically clear the core 1 software interrupt flag.
//               Read to get the status of this flag.
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_RESET  _u(0x0)
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_BITS   _u(0x00000200)
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_MSB    _u(9)
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_LSB    _u(9)
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_RISCV_SOFTIRQ_CORE0_CLR
// Description : Write 1 to atomically clear the core 0 software interrupt flag.
//               Read to get the status of this flag.
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_RESET  _u(0x0)
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_BITS   _u(0x00000100)
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_MSB    _u(8)
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_LSB    _u(8)
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_RISCV_SOFTIRQ_CORE1_SET
// Description : Write 1 to atomically set the core 1 software interrupt flag.
//               Read to get the status of this flag.
#define SIO_RISCV_SOFTIRQ_CORE1_SET_RESET  _u(0x0)
#define SIO_RISCV_SOFTIRQ_CORE1_SET_BITS   _u(0x00000002)
#define SIO_RISCV_SOFTIRQ_CORE1_SET_MSB    _u(1)
#define SIO_RISCV_SOFTIRQ_CORE1_SET_LSB    _u(1)
#define SIO_RISCV_SOFTIRQ_CORE1_SET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_RISCV_SOFTIRQ_CORE0_SET
// Description : Write 1 to atomically set the core 0 software interrupt flag.
//               Read to get the status of this flag.
#define SIO_RISCV_SOFTIRQ_CORE0_SET_RESET  _u(0x0)
#define SIO_RISCV_SOFTIRQ_CORE0_SET_BITS   _u(0x00000001)
#define SIO_RISCV_SOFTIRQ_CORE0_SET_MSB    _u(0)
#define SIO_RISCV_SOFTIRQ_CORE0_SET_LSB    _u(0)
#define SIO_RISCV_SOFTIRQ_CORE0_SET_ACCESS "RW"
// =============================================================================
// Register    : SIO_MTIME_CTRL
// Description : Control register for the RISC-V 64-bit Machine-mode timer. This
//               timer is only present in the Secure SIO, so is only accessible
//               to an Arm core in Secure mode or a RISC-V core in Machine mode.
//
//               Note whilst this timer follows the RISC-V privileged
//               specification, it is equally usable by the Arm cores. The
//               interrupts are routed to normal system-level interrupt lines as
//               well as to the MIP.MTIP inputs on the RISC-V cores.
#define SIO_MTIME_CTRL_OFFSET _u(0x000001a4)
#define SIO_MTIME_CTRL_BITS   _u(0x0000000f)
#define SIO_MTIME_CTRL_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : SIO_MTIME_CTRL_DBGPAUSE_CORE1
// Description : If 1, the timer pauses when core 1 is in the debug halt state.
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_RESET  _u(0x1)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_BITS   _u(0x00000008)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_MSB    _u(3)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_LSB    _u(3)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_MTIME_CTRL_DBGPAUSE_CORE0
// Description : If 1, the timer pauses when core 0 is in the debug halt state.
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_RESET  _u(0x1)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_BITS   _u(0x00000004)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_MSB    _u(2)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_LSB    _u(2)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_MTIME_CTRL_FULLSPEED
// Description : If 1, increment the timer every cycle (i.e. run directly from
//               the system clock), rather than incrementing on the system-level
//               timer tick input.
#define SIO_MTIME_CTRL_FULLSPEED_RESET  _u(0x0)
#define SIO_MTIME_CTRL_FULLSPEED_BITS   _u(0x00000002)
#define SIO_MTIME_CTRL_FULLSPEED_MSB    _u(1)
#define SIO_MTIME_CTRL_FULLSPEED_LSB    _u(1)
#define SIO_MTIME_CTRL_FULLSPEED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_MTIME_CTRL_EN
// Description : Timer enable bit. When 0, the timer will not increment
//               automatically.
#define SIO_MTIME_CTRL_EN_RESET  _u(0x1)
#define SIO_MTIME_CTRL_EN_BITS   _u(0x00000001)
#define SIO_MTIME_CTRL_EN_MSB    _u(0)
#define SIO_MTIME_CTRL_EN_LSB    _u(0)
#define SIO_MTIME_CTRL_EN_ACCESS "RW"
// =============================================================================
// Register    : SIO_MTIME
// Description : Read/write access to the high half of RISC-V Machine-mode
//               timer. This register is shared between both cores. If both
//               cores write on the same cycle, core 1 takes precedence.
#define SIO_MTIME_OFFSET _u(0x000001b0)
#define SIO_MTIME_BITS   _u(0xffffffff)
#define SIO_MTIME_RESET  _u(0x00000000)
#define SIO_MTIME_MSB    _u(31)
#define SIO_MTIME_LSB    _u(0)
#define SIO_MTIME_ACCESS "RW"
// =============================================================================
// Register    : SIO_MTIMEH
// Description : Read/write access to the high half of RISC-V Machine-mode
//               timer. This register is shared between both cores. If both
//               cores write on the same cycle, core 1 takes precedence.
#define SIO_MTIMEH_OFFSET _u(0x000001b4)
#define SIO_MTIMEH_BITS   _u(0xffffffff)
#define SIO_MTIMEH_RESET  _u(0x00000000)
#define SIO_MTIMEH_MSB    _u(31)
#define SIO_MTIMEH_LSB    _u(0)
#define SIO_MTIMEH_ACCESS "RW"
// =============================================================================
// Register    : SIO_MTIMECMP
// Description : Low half of RISC-V Machine-mode timer comparator. This register
//               is core-local, i.e., each core gets a copy of this register,
//               with the comparison result routed to its own interrupt line.
//
//               The timer interrupt is asserted whenever MTIME is greater than
//               or equal to MTIMECMP. This comparison is unsigned, and
//               performed on the full 64-bit values.
#define SIO_MTIMECMP_OFFSET _u(0x000001b8)
#define SIO_MTIMECMP_BITS   _u(0xffffffff)
#define SIO_MTIMECMP_RESET  _u(0xffffffff)
#define SIO_MTIMECMP_MSB    _u(31)
#define SIO_MTIMECMP_LSB    _u(0)
#define SIO_MTIMECMP_ACCESS "RW"
// =============================================================================
// Register    : SIO_MTIMECMPH
// Description : High half of RISC-V Machine-mode timer comparator. This
//               register is core-local.
//
//               The timer interrupt is asserted whenever MTIME is greater than
//               or equal to MTIMECMP. This comparison is unsigned, and
//               performed on the full 64-bit values.
#define SIO_MTIMECMPH_OFFSET _u(0x000001bc)
#define SIO_MTIMECMPH_BITS   _u(0xffffffff)
#define SIO_MTIMECMPH_RESET  _u(0xffffffff)
#define SIO_MTIMECMPH_MSB    _u(31)
#define SIO_MTIMECMPH_LSB    _u(0)
#define SIO_MTIMECMPH_ACCESS "RW"
// =============================================================================
// Register    : SIO_TMDS_CTRL
// Description : Control register for TMDS encoder.
#define SIO_TMDS_CTRL_OFFSET _u(0x000001c0)
#define SIO_TMDS_CTRL_BITS   _u(0x1f9fffff)
#define SIO_TMDS_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_CLEAR_BALANCE
// Description : Clear the running DC balance state of the TMDS encoders. This
//               bit should be written once at the beginning of each scanline.
#define SIO_TMDS_CTRL_CLEAR_BALANCE_RESET  _u(0x0)
#define SIO_TMDS_CTRL_CLEAR_BALANCE_BITS   _u(0x10000000)
#define SIO_TMDS_CTRL_CLEAR_BALANCE_MSB    _u(28)
#define SIO_TMDS_CTRL_CLEAR_BALANCE_LSB    _u(28)
#define SIO_TMDS_CTRL_CLEAR_BALANCE_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_PIX2_NOSHIFT
// Description : When encoding two pixels's worth of symbols in one cycle (a
//               read of a PEEK/POP_DOUBLE register), the second encoder sees a
//               shifted version of the colour data register.
//
//               This control disables that shift, so that both encoder layers
//               see the same pixel data. This is used for pixel doubling.
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_RESET  _u(0x0)
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_BITS   _u(0x08000000)
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_MSB    _u(27)
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_LSB    _u(27)
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_PIX_SHIFT
// Description : Shift applied to the colour data register with each read of a
//               POP alias register.
//
//               Reading from the POP_SINGLE register, or reading from the
//               POP_DOUBLE register with PIX2_NOSHIFT set (for pixel doubling),
//               shifts by the indicated amount.
//
//               Reading from a POP_DOUBLE register when PIX2_NOSHIFT is clear
//               will shift by double the indicated amount. (Shift by 32 means
//               no shift.)
//               0x0 -> Do not shift the colour data register.
//               0x1 -> Shift the colour data register by 1 bit
//               0x2 -> Shift the colour data register by 2 bits
//               0x3 -> Shift the colour data register by 4 bits
//               0x4 -> Shift the colour data register by 8 bits
//               0x5 -> Shift the colour data register by 16 bits
#define SIO_TMDS_CTRL_PIX_SHIFT_RESET  _u(0x0)
#define SIO_TMDS_CTRL_PIX_SHIFT_BITS   _u(0x07000000)
#define SIO_TMDS_CTRL_PIX_SHIFT_MSB    _u(26)
#define SIO_TMDS_CTRL_PIX_SHIFT_LSB    _u(24)
#define SIO_TMDS_CTRL_PIX_SHIFT_ACCESS "RW"
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_0 _u(0x0)
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_1 _u(0x1)
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_2 _u(0x2)
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_4 _u(0x3)
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_8 _u(0x4)
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_16 _u(0x5)
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_INTERLEAVE
// Description : Enable lane interleaving for reads of PEEK_SINGLE/POP_SINGLE.
//
//               When interleaving is disabled, each of the 3 symbols appears as
//               a contiguous 10-bit field, with lane 0 being the least-
//               significant and starting at bit 0 of the register.
//
//               When interleaving is enabled, the symbols are packed into 5
//               chunks of 3 lanes times 2 bits (30 bits total). Each chunk
//               contains two bits of a TMDS symbol per lane, with lane 0 being
//               the least significant.
#define SIO_TMDS_CTRL_INTERLEAVE_RESET  _u(0x0)
#define SIO_TMDS_CTRL_INTERLEAVE_BITS   _u(0x00800000)
#define SIO_TMDS_CTRL_INTERLEAVE_MSB    _u(23)
#define SIO_TMDS_CTRL_INTERLEAVE_LSB    _u(23)
#define SIO_TMDS_CTRL_INTERLEAVE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L2_NBITS
// Description : Number of valid colour MSBs for lane 2 (1-8 bits, encoded as 0
//               through 7). Remaining LSBs are masked to 0 after the rotate.
#define SIO_TMDS_CTRL_L2_NBITS_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L2_NBITS_BITS   _u(0x001c0000)
#define SIO_TMDS_CTRL_L2_NBITS_MSB    _u(20)
#define SIO_TMDS_CTRL_L2_NBITS_LSB    _u(18)
#define SIO_TMDS_CTRL_L2_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L1_NBITS
// Description : Number of valid colour MSBs for lane 1 (1-8 bits, encoded as 0
//               through 7). Remaining LSBs are masked to 0 after the rotate.
#define SIO_TMDS_CTRL_L1_NBITS_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L1_NBITS_BITS   _u(0x00038000)
#define SIO_TMDS_CTRL_L1_NBITS_MSB    _u(17)
#define SIO_TMDS_CTRL_L1_NBITS_LSB    _u(15)
#define SIO_TMDS_CTRL_L1_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L0_NBITS
// Description : Number of valid colour MSBs for lane 0 (1-8 bits, encoded as 0
