Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/sio.h
//               through 7). Remaining LSBs are masked to 0 after the rotate.
#define SIO_TMDS_CTRL_L0_NBITS_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L0_NBITS_BITS   _u(0x00007000)
#define SIO_TMDS_CTRL_L0_NBITS_MSB    _u(14)
#define SIO_TMDS_CTRL_L0_NBITS_LSB    _u(12)
#define SIO_TMDS_CTRL_L0_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L2_ROT
// Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
//               bits, in order to get the MSB of the lane 2 (red) colour data
//               aligned with the MSB of the 8-bit encoder input.
//
//               For example, for RGB565 (red most significant), red is bits
//               15:11, so should be right-rotated by 8 bits to align with bits
//               7:3 of the encoder input.
#define SIO_TMDS_CTRL_L2_ROT_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L2_ROT_BITS   _u(0x00000f00)
#define SIO_TMDS_CTRL_L2_ROT_MSB    _u(11)
#define SIO_TMDS_CTRL_L2_ROT_LSB    _u(8)
#define SIO_TMDS_CTRL_L2_ROT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L1_ROT
// Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
//               bits, in order to get the MSB of the lane 1 (green) colour data
//               aligned with the MSB of the 8-bit encoder input.
//
//               For example, for RGB565, green is bits 10:5, so should be
//               right-rotated by 3 bits to align with bits 7:2 of the encoder
//               input.
#define SIO_TMDS_CTRL_L1_ROT_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L1_ROT_BITS   _u(0x000000f0)
#define SIO_TMDS_CTRL_L1_ROT_MSB    _u(7)
#define SIO_TMDS_CTRL_L1_ROT_LSB    _u(4)
#define SIO_TMDS_CTRL_L1_ROT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SIO_TMDS_CTRL_L0_ROT
// Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
//               bits, in order to get the MSB of the lane 0 (blue) colour data
//               aligned with the MSB of the 8-bit encoder input.
//
//               For example, for RGB565 (red most significant), blue is bits
//               4:0, so should be right-rotated by 13 to align with bits 7:3 of
//               the encoder input.
#define SIO_TMDS_CTRL_L0_ROT_RESET  _u(0x0)
#define SIO_TMDS_CTRL_L0_ROT_BITS   _u(0x0000000f)
#define SIO_TMDS_CTRL_L0_ROT_MSB    _u(3)
#define SIO_TMDS_CTRL_L0_ROT_LSB    _u(0)
#define SIO_TMDS_CTRL_L0_ROT_ACCESS "RW"
// =============================================================================
// Register    : SIO_TMDS_WDATA
// Description : Write-only access to the TMDS colour data register.
#define SIO_TMDS_WDATA_OFFSET _u(0x000001c4)
#define SIO_TMDS_WDATA_BITS   _u(0xffffffff)
#define SIO_TMDS_WDATA_RESET  _u(0x00000000)
#define SIO_TMDS_WDATA_MSB    _u(31)
#define SIO_TMDS_WDATA_LSB    _u(0)
#define SIO_TMDS_WDATA_ACCESS "WO"
// =============================================================================
// Register    : SIO_TMDS_PEEK_SINGLE
// Description : Get the encoding of one pixel's worth of colour data, packed
//               into a 32-bit value (3x10-bit symbols).
//
//               The PEEK alias does not shift the colour register when read,
//               but still advances the running DC balance state of each
//               encoder. This is useful for pixel doubling.
#define SIO_TMDS_PEEK_SINGLE_OFFSET _u(0x000001c8)
#define SIO_TMDS_PEEK_SINGLE_BITS   _u(0xffffffff)
#define SIO_TMDS_PEEK_SINGLE_RESET  _u(0x00000000)
#define SIO_TMDS_PEEK_SINGLE_MSB    _u(31)
#define SIO_TMDS_PEEK_SINGLE_LSB    _u(0)
#define SIO_TMDS_PEEK_SINGLE_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_POP_SINGLE
// Description : Get the encoding of one pixel's worth of colour data, packed
//               into a 32-bit value. The packing is 5 chunks of 3 lanes times 2
//               bits (30 bits total). Each chunk contains two bits of a TMDS
//               symbol per lane. This format is intended for shifting out with
//               the HSTX peripheral on RP2350.
//
//               The POP alias shifts the colour register when read, as well as
//               advancing the running DC balance state of each encoder.
#define SIO_TMDS_POP_SINGLE_OFFSET _u(0x000001cc)
#define SIO_TMDS_POP_SINGLE_BITS   _u(0xffffffff)
#define SIO_TMDS_POP_SINGLE_RESET  _u(0x00000000)
#define SIO_TMDS_POP_SINGLE_MSB    _u(31)
#define SIO_TMDS_POP_SINGLE_LSB    _u(0)
#define SIO_TMDS_POP_SINGLE_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_PEEK_DOUBLE_L0
// Description : Get lane 0 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The PEEK alias does not shift the colour register when read,
//               but still advances the lane 0 DC balance state. This is useful
//               if all 3 lanes' worth of encode are to be read at once, rather
//               than processing the entire scanline for one lane before moving
//               to the next lane.
#define SIO_TMDS_PEEK_DOUBLE_L0_OFFSET _u(0x000001d0)
#define SIO_TMDS_PEEK_DOUBLE_L0_BITS   _u(0xffffffff)
#define SIO_TMDS_PEEK_DOUBLE_L0_RESET  _u(0x00000000)
#define SIO_TMDS_PEEK_DOUBLE_L0_MSB    _u(31)
#define SIO_TMDS_PEEK_DOUBLE_L0_LSB    _u(0)
#define SIO_TMDS_PEEK_DOUBLE_L0_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_POP_DOUBLE_L0
// Description : Get lane 0 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The POP alias shifts the colour register when read, according
//               to the values of PIX_SHIFT and PIX2_NOSHIFT.
#define SIO_TMDS_POP_DOUBLE_L0_OFFSET _u(0x000001d4)
#define SIO_TMDS_POP_DOUBLE_L0_BITS   _u(0xffffffff)
#define SIO_TMDS_POP_DOUBLE_L0_RESET  _u(0x00000000)
#define SIO_TMDS_POP_DOUBLE_L0_MSB    _u(31)
#define SIO_TMDS_POP_DOUBLE_L0_LSB    _u(0)
#define SIO_TMDS_POP_DOUBLE_L0_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_PEEK_DOUBLE_L1
// Description : Get lane 1 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The PEEK alias does not shift the colour register when read,
//               but still advances the lane 1 DC balance state. This is useful
//               if all 3 lanes' worth of encode are to be read at once, rather
//               than processing the entire scanline for one lane before moving
//               to the next lane.
#define SIO_TMDS_PEEK_DOUBLE_L1_OFFSET _u(0x000001d8)
#define SIO_TMDS_PEEK_DOUBLE_L1_BITS   _u(0xffffffff)
#define SIO_TMDS_PEEK_DOUBLE_L1_RESET  _u(0x00000000)
#define SIO_TMDS_PEEK_DOUBLE_L1_MSB    _u(31)
#define SIO_TMDS_PEEK_DOUBLE_L1_LSB    _u(0)
#define SIO_TMDS_PEEK_DOUBLE_L1_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_POP_DOUBLE_L1
// Description : Get lane 1 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The POP alias shifts the colour register when read, according
//               to the values of PIX_SHIFT and PIX2_NOSHIFT.
#define SIO_TMDS_POP_DOUBLE_L1_OFFSET _u(0x000001dc)
#define SIO_TMDS_POP_DOUBLE_L1_BITS   _u(0xffffffff)
#define SIO_TMDS_POP_DOUBLE_L1_RESET  _u(0x00000000)
#define SIO_TMDS_POP_DOUBLE_L1_MSB    _u(31)
#define SIO_TMDS_POP_DOUBLE_L1_LSB    _u(0)
#define SIO_TMDS_POP_DOUBLE_L1_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_PEEK_DOUBLE_L2
// Description : Get lane 2 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The PEEK alias does not shift the colour register when read,
//               but still advances the lane 2 DC balance state. This is useful
//               if all 3 lanes' worth of encode are to be read at once, rather
//               than processing the entire scanline for one lane before moving
//               to the next lane.
#define SIO_TMDS_PEEK_DOUBLE_L2_OFFSET _u(0x000001e0)
#define SIO_TMDS_PEEK_DOUBLE_L2_BITS   _u(0xffffffff)
#define SIO_TMDS_PEEK_DOUBLE_L2_RESET  _u(0x00000000)
#define SIO_TMDS_PEEK_DOUBLE_L2_MSB    _u(31)
#define SIO_TMDS_PEEK_DOUBLE_L2_LSB    _u(0)
#define SIO_TMDS_PEEK_DOUBLE_L2_ACCESS "RF"
// =============================================================================
// Register    : SIO_TMDS_POP_DOUBLE_L2
// Description : Get lane 2 of the encoding of two pixels' worth of colour data.
//               Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
//               word.
//
//               The POP alias shifts the colour register when read, according
//               to the values of PIX_SHIFT and PIX2_NOSHIFT.
#define SIO_TMDS_POP_DOUBLE_L2_OFFSET _u(0x000001e4)
#define SIO_TMDS_POP_DOUBLE_L2_BITS   _u(0xffffffff)
#define SIO_TMDS_POP_DOUBLE_L2_RESET  _u(0x00000000)
#define SIO_TMDS_POP_DOUBLE_L2_MSB    _u(31)
#define SIO_TMDS_POP_DOUBLE_L2_LSB    _u(0)
#define SIO_TMDS_POP_DOUBLE_L2_ACCESS "RF"
// =============================================================================
#endif // _HARDWARE_REGS_SIO_H

